Revit 2015 API
PathReinforcement.Create Method
Overload List
Name | Description
Create(Document, Element, IList<Curve>, Boolean) |  Obsolete.
 Creates a new PathReinforcement object from an array of curves.
Create(Document, Element, IList<Curve>, Boolean, ElementId, ElementId, ElementId, ElementId)
 Creates a new PathReinforcement object from an array of curves. This method replaces the NewPathReinforcement method, which has been deprecated.
See Also
PathReinforcement Class
PathReinforcement Members
Autodesk.Revit.DB.Structure Namespace